[
  {
    "name": "Сайт для обучения иностранным языкам",
    "description": "Сайт, на котором пользователи могут изучать разные иностранные языки с помощью интерактивных уроков, игр и тестов. Сайт также подбирает пользователю партнера по языковому обмену, с которым он может практиковать разговорный язык через видео- или аудио-чат. Сайт также отслеживает прогресс пользователя и дает ему обратную связь.",
    "skills": ["HTML", "CSS", "JavaScript", "React", "Node.js", "MongoDB", "WebRTC"]
  },
  {
    "name": "Приложение для редактирования фотографий",
    "description": "Приложение, которое позволяет пользователю редактировать свои фотографии с помощью разных фильтров, эффектов и инструментов. Пользователь может обрезать, поворачивать, настраивать яркость, контраст, насыщенность и другие параметры фотографии. Пользователь также может добавлять текст, стикеры, рамки и другие элементы к своим фотографиям.",
    "skills": ["Java", "Kotlin", "Swift", "Glide", "Picasso", "SDWebImage"]
  },
  {
    "name": "Веб-приложение для создания опросов",
    "description": "Веб-приложение для создания опросов позволяет пользователю создавать и распространять онлайн-опросы по разным темам. Пользователь может выбирать тип вопроса (один или несколько вариантов ответа, текстовый ответ, шкала оценки и т.д.), добавлять изображения или видео к вопросам, настраивать дизайн и логику опроса. Пользователь также может анализировать результаты опроса с помощью графиков и таблиц.",
    "skills": ["HTML", "CSS", "JavaScript", "Angular", "Node.js", "MySQL"]
  },
  {
    "name": "Мобильное приложение для поиска музыки",
    "description": "Мобильное приложение для поиска музыки позволяет пользователю находить музыку по разным критериям. Пользователь может вводить название песни, исполнителя или альбома, или использовать голосовой поиск. Пользователь также может искать музыку по жанру, настроению или ситуации. Приложение также предлагает пользователю персонализированные плейлисты и рекомендации по музыке.",
    "skills": ["Java", "Kotlin", "Swift", "Spotify API", "Apple Music API", "Deezer API"]
  },
  {
    "name": "Веб-приложение для создания резюме",
    "description": "Веб-приложение для создания резюме помогает пользователю создать профессиональное резюме за несколько минут. Пользователь может выбрать из разных шаблонов резюме, заполнить свои данные и скачать резюме в формате PDF или DOCX. Приложение также дает пользователю советы по написанию резюме и проверяет его на ошибки и плагиат.",
    "skills": ["HTML", "CSS", "JavaScript", "Vue.js", "Node.js", "MongoDB"]
  },
  {
    "name": "Игра в жанре tower defense",
    "description": "Игра в жанре tower defense - это игра, в которой игрок должен защищать свою базу от волн врагов с помощью разных видов башен. Башни имеют разные характеристики, такие как стоимость, скорость атаки, радиус действия и тип урона. Игрок может улучшать свои башни или покупать новые за заработанные очки. Игра имеет разные уровни сложности и режимы игры.",
    "skills": ["C#", "Unity"]
  },
  {
    "name": "Приложение для распознавания растений",
    "description": "Приложение для распознавания растений позволяет пользователю определить вид растения по его фотографии. Приложение использует нейронные сети для классификации растений по разным признакам, таким как форма листьев, цвет цветков, тип стебля и т.д. Приложение также предоставляет пользователю информацию о растении, такую как название, описание, место произрастания и полезные свойства.",
    "skills": ["Java", "Kotlin", "Swift", "TensorFlow Lite", "PyTorch Mobile", "Core ML"]
  },
  {
    "name": "Сайт для обмена книгами",
    "description": "Сайт, на котором пользователи могут выставлять свои книги на обмен, искать книги других пользователей и договариваться о способах доставки. Сайт также предоставляет рекомендации по книгам, основанные на интересах и отзывах пользователей.",
    "skills": ["HTML", "CSS", "JavaScript", "React", "Node.js", "MongoDB", "REST API"]
  },
  {
    "name": "Приложение для управления задачами",
    "description": "Приложение, которое позволяет создавать и отслеживать задачи, назначать их исполнителям, устанавливать сроки и приоритеты, получать уведомления о статусе задач. Приложение также интегрируется с другими сервисами, такими как Google Calendar, Slack и Trello.",
    "skills": ["Python", "Django", "PostgreSQL", "Celery", "Redis", "GraphQL API"]
  },
  {
    "name": "Игра в жанре roguelike",
    "description": "Игра, в которой игрок перемещается по случайно генерируемому подземелью, сражается с врагами и собирает предметы. Игра имеет высокий уровень сложности и перманентную смерть персонажа. Игра также поддерживает кооперативный режим для двух или более игроков.",
    "skills": ["C#", "Unity", "Photon Unity Networking"]
  },
  {
    "name": "Сервис для анализа тональности текстов",
    "description": "Сервис, который принимает на вход текст на любом языке и возвращает его тональность (положительную, отрицательную или нейтральную), а также эмоции (радость, гнев, грусть и т.д.), которые он выражает. Сервис использует нейронные сети для обработки естественного языка.",
    "skills": ["Python", "PyTorch", "Transformers", "FastAPI"]
  },
  {
    "name": "Платформа для создания онлайн-курсов",
    "description": "Платформа, на которой преподаватели могут создавать и продавать свои онлайн-курсы по разным темам. Платформа предоставляет инструменты для создания видеоуроков, тестов, заданий и сертификатов. Платформа также позволяет студентам общаться с преподавателями и другими студентами через чаты и форумы.",
    "skills": ["Ruby on Rails", "Bootstrap", "Stripe API"]
  },
  {
    "name": "Бот для Telegram",
    "description": "Бот для мессенджера Telegram, который выполняет различные функции по запросу пользователя. Например, бот может отправлять погоду по городу, переводить тексты с одного языка на другой, генерировать мемы или шутки и т.д.",
    "skills": ["Python", "Telebot API"]
  },
  {
    "name": "Сайт для поиска рецептов",
    "description": "Сайт, на котором пользователи могут искать рецепты по ингредиентам, кухне или типу блюда. Сайт также показывает питательную ценность рецептов, время приготовления и сложность. Сайт также дает возможность пользователем оставлять отзывы и рейтинги рецептам.",
    "skills": ["PHP", "Laravel", "MySQL"]
  },
  {
    "name": "Приложение для распознавания лиц",
    "description": "Приложение, которое использует камеру смартфона для распознавания лиц людей в реальном времени. Приложение может определять пол, возраст и эмоции человека по его лицу. Приложение также может сравнивать лица с известными личностями или друзьями пользователя из социальных сетей.",
    "skills": ["Java", "Kotlin", "Swift", "OpenCV", "ML Kit", "Face API"]
  },

  {
    "name": "Веб-скрейпер для сбора данных",
    "description": "Веб-скрейпер - это программа, которая автоматически извлекает данные с веб-страниц по заданным критериям. Например, веб-скрейпер может собирать информацию о товарах с интернет-магазинов или новости с новостных сайтов. Веб-скрейпер может сохранять данные в файл или базу данных.",
    "skills": ["Python", "JavaScript", "Perl", "BeautifulSoup", "Selenium", "Scrapy", "LXML"]
  },
  {
    "name": "Чатбот для заказа еды",
    "description": "Чатбот - это программа, которая имитирует разговор с человеком через текстовый или голосовой интерфейс. Чатбот для заказа еды позволяет пользователю выбирать блюда из меню разных ресторанов, указывать адрес доставки и способ оплаты. Чатбот также отвечает на вопросы пользователя о статусе заказа или аллергенах в еде.",
    "skills": ["Python", "JavaScript", "Java", "Dialogflow", "Rasa", "Wit.ai"]
  },
  {
    "name": "Мобильное приложение для фитнеса",
    "description": "Мобильное приложение для фитнеса помогает пользователю следить за своим здоровьем и физической активностью. Приложение может отслеживать шаги, калории, сердечный ритм и другие параметры пользователя с помощью датчиков смартфона или умных часов. Приложение также может предлагать пользователю индивидуальные тренировки, диеты и напоминания о здоровом образе жизни.",
    "skills": ["Java", "Kotlin", "Swift", "Firebase", "Parse", "Realm"]
  }
]
